from json import dump, load

# покупатель = {
# 	'петров': {
# 		'имя':'петя',
# 		'дата рождения': '1999.01.01',
# 		'адрес' : 'попова 10'
# 	}
# }

# магазин = {
# 	'пятерочка': {
# 		'адрес' : 'попова 27'
# 	},

# 	'магнит': {
# 		'адрес' : 'пушкина 44'
# 	}
# }

# продажа = {
# 	 'петров^пятерочка^яблоко': {
# 	 	'кол-во' : 12, 
# 	 	'цена' : 2350
# 	 }
# }

# dump(покупатель, open('покупатель', 'w'), ensure_ascii = 0, indent = 4)
# dump(магазин, open('магазин', 'w'), ensure_ascii = 0, indent = 4)
# dump(продажа, open('продажа', 'w'), ensure_ascii = 0, indent = 4)

покупатель = load(open('покупатель'))
магазин = load(open('магазин'))
продажа = load(open('продажа'))

print (покупатель , магазин, продажа)